import Category from './Category';
import { useState } from 'react';
import { useParams } from 'react-router-dom';
const questionsArray = [
  {
    id: 'D1',
    question: 'Що приносить вам найбільше щастя?',
    category: 'Душа',
  },
  { id: 'D2', question: 'Який ваш найглибший страх?', category: 'Душа' },
  {
    id: 'D3',
    question: 'Що для вас означає справжня любов?',
    category: 'Душа',
  },
  { id: 'D4', question: 'Як ви справляєтеся зі стресом?', category: 'Душа' },
  {
    id: 'D5',
    question:
      'Який момент у вашому житті змусив вас переглянути свої цінності?',
    category: 'Душа',
  },
  {
    id: 'D6',
    question: 'Яка ваша найбільша мрія, здійснення якої майже нереальне?',
    category: 'Душа',
  },
  { id: 'D7', question: 'Що вас надихає у важкі часи?', category: 'Душа' },
  {
    id: 'D8',
    question: 'Які якості ви найбільше цінуєте в людях? Назвіть 5.',
    category: 'Душа',
  },
  {
    id: 'D9',
    question: 'Як ви визначаєте успіх у своєму житті?',
    category: 'Душа',
  },
  {
    id: 'D10',
    question: 'Які ваші улюблені способи відпочинку?',
    category: 'Душа',
  },
  { id: 'D11', question: 'Як ви реагуєте на критику?', category: 'Душа' },
  {
    id: 'D12',
    question:
      'Яке ваше найсміливіше рішення у житті? Або що б ви хотіли змінити, але не наважуєтесь.',
    category: 'Душа',
  },
  {
    id: 'D13',
    question: 'Що для вас дружба? Чи важливо мати друзів у старшому віці?',
    category: 'Душа',
  },
  {
    id: 'D14',
    question:
      'Як ви зазвичай справляєтеся з невдачами? Чи часто опускаються у вас руки?',
    category: 'Душа',
  },
  {
    id: 'D15',
    question: 'Яка ваша найулюбленіший спогад з дитинства?',
    category: 'Душа',
  },
  {
    id: 'D16',
    question: 'Як ви уявляєте своє ідеальне майбутнє?',
    category: 'Душа',
  },
  {
    id: 'D17',
    question: 'Що вам допомагає бути мотивованим?',
    category: 'Душа',
  },
  {
    id: 'D18',
    question: 'Які ваші найбільші життєві цілі?',
    category: 'Душа',
  },
  {
    id: 'D19',
    question: 'Як ви визначаєте баланс між роботою та особистим життям?',
    category: 'Душа',
  },
  {
    id: 'D20',
    question: 'Які книги або фільми найбільше вплинули на ваше життя?',
    category: 'Душа',
  },
  { id: 'D21', question: 'Як ви ставитеся до змін?', category: 'Душа' },
  {
    id: 'D22',
    question: 'Що ви робите, коли відчуваєте самотність?',
    category: 'Душа',
  },
  {
    id: 'D23',
    question: 'Які риси характеру ви хочете розвивати у собі?',
    category: 'Душа',
  },
  { id: 'D24', question: 'Що вас найбільше мотивує?', category: 'Душа' },
  {
    id: 'D25',
    question: 'Як ви ставитеся до спонтанних рішень?',
    category: 'Душа',
  },
  { id: 'D26', question: 'Як ви долаєте свої комплекси?', category: 'Душа' },
  { id: 'D27', question: 'Яка ваша найбільша слабкість?', category: 'Душа' },
  {
    id: 'D28',
    question: 'Що вам допомагає знайти спокій у стресових ситуаціях?',
    category: 'Душа',
  },
  {
    id: 'D29',
    question: 'Яке ваше улюблене заняття для релаксації?',
    category: 'Душа',
  },
  {
    id: 'D30',
    question: 'Як ви ставитеся до випадкових зустрічей у житті?',
    category: 'Душа',
  },
  {
    id: 'D31',
    question: 'Що вас надихає на нові починання?',
    category: 'Душа',
  },
  {
    id: 'D32',
    question: 'Яке ваше улюблене місце для роздумів?',
    category: 'Душа',
  },
  {
    id: 'D33',
    question: 'Як ви визначаєте справжню свободу?',
    category: 'Душа',
  },
  {
    id: 'D34',
    question: 'Що для вас є найціннішим у житті?',
    category: 'Душа',
  },
  {
    id: 'D35',
    question: 'Яке ваше улюблене заняття, коли вам сумно?',
    category: 'Душа',
  },
  {
    id: 'D36',
    question: 'Що допомагає вам відновлювати енергію?',
    category: 'Душа',
  },
  { id: 'D37', question: 'Як ви справляєтеся з тривогою?', category: 'Душа' },
  {
    id: 'D38',
    question: 'Що для вас є найважливішим у дружбі?',
    category: 'Душа',
  },
  {
    id: 'D39',
    question:
      'Як ви ставитеся до спогадів? Чи часто ви згадуєте минуле або живете ним?',
    category: 'Душа',
  },
  {
    id: 'D40',
    question: "Що для вас означає 'жити в моменті'?",
    category: 'Душа',
  },
  {
    id: 'D41',
    question:
      'Яка була ваша найбільша неправда, яку ви коли-небудь говорили другу?',
    category: 'Душа',
  },
  {
    id: 'D42',
    question:
      "Який був найсором'язливіший момент у вашому житті, який ви не любите згадувати?",
    category: 'Душа',
  },
  {
    id: 'D43',
    question:
      'Чи було у вас коли-небудь захоплення, про яке ніхто не знає? Яке?',
    category: 'Душа',
  },
  {
    id: 'D44',
    question:
      'Який був ваш найгірший флірт або не вдала спроба завести знайомство?',
    category: 'Душа',
  },
  {
    id: 'D45',
    question: 'Чи є щось, що ви хотіли б змінити в своєму минулому? Що саме?',
    category: 'Душа',
  },
  {
    id: 'D46',
    question:
      'Чи є у вас якась таємниця, яку ви ніколи не розповідали ні друзям, ні родині?',
    category: 'Душа',
  },
  {
    id: 'D47',
    question:
      'Яка ваша найбільша слабкість, про яку ви б не хотіли, щоб хтось дізнався?',
    category: 'Душа',
  },
  {
    id: 'D48',
    question:
      "Яке найсором'язливіше або найнезвичайніше повідомлення ви коли-небудь надсилали комусь?",
    category: 'Душа',
  },
  {
    id: 'D49',
    question: 'Яка найбільша брехня, яку ви сказали батькам, і чому?',
    category: 'Душа',
  },
  { id: 'D50', question: 'Ваш найбільший страх?', category: 'Душа' },
  {
    id: 'D51',
    question: 'Які були ваші найскладніші стосунки з одним з родичів і чому?',
    category: 'Душа',
  },
  {
    id: 'D52',
    question: 'Яка була ваша найбільша сварка з батьками або братами/сестрами?',
    category: 'Душа',
  },
  {
    id: 'D53',
    question:
      'Чи був якийсь максимально складний період у вашому житті? Розкажіть.',
    category: 'Душа',
  },
  {
    id: 'H1',
    question:
      'Якби ви могли подорожувати в будь-який час, до якого періоду ви б відправилися?',
    category: 'Гіпотетично',
  },
  {
    id: 'H2',
    question: 'Якщо б ви могли вибрати будь-яку суперсилу, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H3',
    question:
      'Яка була б ваша перша дія, якби ви стали президентом на один день?',
    category: 'Гіпотетично',
  },
  {
    id: 'H4',
    question: 'Якби ви могли жити в будь-якому місті світу, яке б ви вибрали?',
    category: 'Гіпотетично',
  },
  {
    id: 'H5',
    question:
      'Якщо б ви могли навчитися будь-якому новому навику миттєво, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H6',
    question:
      'Який би ви вибрали жанр для вашого улюбленого фільму, якби могли зняти його?',
    category: 'Гіпотетично',
  },
  {
    id: 'H7',
    question:
      'Якби ви могли провести день з будь-якою історичною особистістю, хто б це був?',
    category: 'Гіпотетично',
  },
  {
    id: 'H8',
    question: 'Якби ви могли змінити одну річ у світі, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H9',
    question:
      'Якщо б ви могли відмовитися від будь-якої своєї звички, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H10',
    question:
      'Якби ви могли зустрітися з будь-яким вигаданим персонажем, кого б ви вибрали?',
    category: 'Гіпотетично',
  },
  {
    id: 'H11',
    question:
      'Якби вам довелося вибрати тільки одну їжу на все життя, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H12',
    question:
      'Якби ви могли жити в будь-якому вигаданому світі, що б це був за світ?',
    category: 'Гіпотетично',
  },
  {
    id: 'H13',
    question:
      'Якби ви могли зустрітися з будь-яким відомим артистом, кого б ви вибрали?',
    category: 'Гіпотетично',
  },
  {
    id: 'H14',
    question: 'Якби ви могли змінити свою професію, що б ви обрали?',
    category: 'Гіпотетично',
  },
  {
    id: 'H15',
    question:
      'Якщо б ви могли виконати будь-яке бажання на один день, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H16',
    question:
      'Якби ви могли вибрати будь-який колір для свого автомобіля, який би це був?',
    category: 'Гіпотетично',
  },
  {
    id: 'H17',
    question:
      'Якби ви могли спробувати будь-яку екстремальну діяльність, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H18',
    question: 'Якби ви могли змінити одне рішення з минулого, яке б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H19',
    question:
      'Якби ви могли провести рік на безлюдному острові, з ким би ви поїхали? Назвіть трьох людей.',
    category: 'Гіпотетично',
  },
  {
    id: 'H20',
    question: 'Що ви б хотіли повторити знову?',
    category: 'Гіпотетично',
  },
  {
    id: 'H21',
    question:
      'Якби вам потрібно було вибрати одну книгу для читання все життя, яка б це була?',
    category: 'Гіпотетично',
  },
  {
    id: 'H22',
    question: 'Якби ви могли зупинити час на один день, що б ви робили?',
    category: 'Гіпотетично',
  },
  {
    id: 'H23',
    question:
      'Якби ви могли переїхати в будь-яку країну, яку б ви вибрали і чому?',
    category: 'Гіпотетично',
  },
  {
    id: 'H24',
    question: 'Якби ви могли вибрати будь-який інструмент, який би це був?',
    category: 'Гіпотетично',
  },
  {
    id: 'H25',
    question:
      'Якби ви могли провести день з кимось, хто вас надихає, хто б це був?',
    category: 'Гіпотетично',
  },
  {
    id: 'H26',
    question:
      'Якби ви могли вибрати будь-яке місце для відпочинку, де б ви зупинилися?',
    category: 'Гіпотетично',
  },
  {
    id: 'H27',
    question:
      'Якби ви могли вибрати будь-яке хобі, яке б це було? На яке не вистачає часу або грошей.',
    category: 'Гіпотетично',
  },
  {
    id: 'H28',
    question:
      'Яке ваше улюблене місце для проведення часу на природі? Гориморе',
    category: 'Гіпотетично',
  },
  {
    id: 'H29',
    question:
      "Якби ви могли змінити своє ім'я, яке б ви вибрали? Назвіть для кожного гравця, яке б йому пасувало ім’я.",
    category: 'Гіпотетично',
  },
  {
    id: 'H30',
    question:
      'Якби ви могли спробувати будь-яку екзотичну їжу, що б це було? Равликижуки, тощо',
    category: 'Гіпотетично',
  },
  {
    id: 'H31',
    question:
      'Якби ви могли знову пережити одне з ваших улюблених дитячих спогадів, яке б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H32',
    question:
      'Якби вам потрібно було вибрати один колір для всього вашого одягу, який би це був? Окрім чорного.',
    category: 'Гіпотетично',
  },
  {
    id: 'H33',
    question:
      'Якби ви могли відзначити свій день народження будь-яким способом, що б ви вибрали?',
    category: 'Гіпотетично',
  },
  {
    id: 'H34',
    question:
      'Якби ви могли вибрати один вид мистецтва, щоб навчитися, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H35',
    question:
      "Якби ви могли відвідати будь-який природний об'єкт на Землі, що б це було?",
    category: 'Гіпотетично',
  },
  {
    id: 'H36',
    question:
      'Якби ви могли вибрати будь-який вид транспорту для подорожі, який би це був?',
    category: 'Гіпотетично',
  },
  {
    id: 'H37',
    question: 'Якби ви могли змінити свій стиль життя, що б ви обрали?',
    category: 'Гіпотетично',
  },
  {
    id: 'H38',
    question:
      'Якби ви могли вибрати одного з кімнати, для проживання рік, хто б це був?',
    category: 'Гіпотетично',
  },
  {
    id: 'H39',
    question:
      'Якби ви могли спробувати будь-яку професію на один день, що б це було?',
    category: 'Гіпотетично',
  },
  {
    id: 'H40',
    question:
      'Якби ви могли провести день у будь-якому вигаданому світі, що б це був за світ?',
    category: 'Гіпотетично',
  },
  {
    id: 'S1',
    question: 'Яка для вас найважливіша частина здорових стосунків?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S2',
    question: 'Як ви ставитеся до обговорення сексуальних потреб із партнером?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S3',
    question: 'Що для вас означає інтимність у стосунках?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S4',
    question: 'Які фактори для вас важливі при виборі партнера для стосунків?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S5',
    question:
      'Як ви визначаєте межі у стосунках? Що для вас «перетин ваших особистих кордонів»?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S6',
    question: "Які емоційні потреби у вас пов'язані із сексуальною близькістю?",
    category: 'Секс і стосунки',
  },
  {
    id: 'S7',
    question: 'Що для вас є ознакою здорових стосунків?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S8',
    question:
      'Як ви ставитеся до обговорення минулого сексуального досвіду з партнером?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S9',
    question: 'Які ваші погляди на експерименти у сексуальному житті?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S10',
    question: 'Які ваші думки про роль романтики у житті?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S11',
    question: 'Яке ваше ставлення до сексу на перших зустрічах?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S12',
    question: 'Які ваші погляди на роль сексу у відносинах?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S13',
    question: 'Які ваші думки про відкриті стосунки?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S14',
    question: 'Як ви ставитеся до зміни сексуальних вподобань з часом?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S15',
    question: 'Що для вас є найважливішим у сексуальному задоволенні?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S16',
    question:
      'Чи важлива сексуальна освіта для дітей у майбутньому? Вам розказували про секс?',
    category: 'Секс і стосунки',
  },
  { id: 'S17', question: 'Що для вас зрада?', category: 'Секс і стосунки' },
  {
    id: 'S18',
    question: 'Чи є у вас табу в сексі?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S19',
    question: 'Секс втрьох? Якщо так, який саме?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S20',
    question: 'Яке дивне порно ви коли-небудь бачили?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S21',
    question: 'Розкажіть смішний випадок, коли ви самозадовольнялись',
    category: 'Секс і стосунки',
  },
  {
    id: 'S22',
    question: 'Чи пробували ви віртуальний секс?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S23',
    question: 'Секс у публічних місцях?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S24',
    question: 'Коли ви дізнались про секс?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S25',
    question: 'Ваш перший секс? Розкажіть',
    category: 'Секс і стосунки',
  },
  { id: 'S26', question: 'Розмір важливий?', category: 'Секс і стосунки' },
  {
    id: 'S27',
    question:
      "Як би ви відреагували, якби дізналися, що ваш партнер має роман з кимось іншим, але це 'тільки для задоволення'?",
    category: 'Секс і стосунки',
  },
  {
    id: 'S28',
    question: 'Які ваші думки про ідею любові з першого погляду?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S29',
    question: 'Як ви ставитеся до ідеї переїхати в іншу країну заради кохання?',
    category: 'Секс і стосунки',
  },
  { id: 'S30', question: 'ЛГБТ?', category: 'Секс і стосунки' },
  {
    id: 'S31',
    question: 'Яке ваше ставлення до ідеї кохання, що починається з сексу?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S32',
    question:
      'Які ваші погляди на можливість закохатися у когось іншого під час перебування у стабільних стосунках?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S33',
    question:
      'Які ваші думки про те, що може бути кохання на відстані? Чи вірите ви, що це можливо?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S34',
    question:
      'Як би ви відреагували на ситуацію, коли ваш партнер не готовий до серйозних стосунків, а ви вже закохані?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S35',
    question:
      "Які ваші думки про те, що може бути необхідно інколи 'відпустити' людину, яку ви любите?",
    category: 'Секс і стосунки',
  },
  {
    id: 'S36',
    question:
      'Як би ви реагували на те, що ваш партнер захотів кардинально змінити своє життя (наприклад, переїхати в інше місто чи змінити професію)?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S37',
    question:
      'Які ваші думки про ідею спільного ведення бізнесу з партнером? Чи вважаєте ви це ризикованим?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S38',
    question:
      'Як ви ставитеся до можливості стосунків з кимось, хто вже мав значний досвід у стосунках?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S39',
    question: 'Чи важлива різниця у віці?',
    category: 'Секс і стосунки',
  },
  {
    id: 'S40',
    question:
      'Як ви ставитеся до ідеї мати окремі фінанси у стосунках? Чи вважаєте ви це важливим для збереження незалежності?',
    category: 'Секс і стосунки',
  },
  {
    id: 'E1',
    question: 'Вічна молодість або безсмертя?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E2',
    question: 'Безмежний запас грошей або бездоганне здоров’я?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E3',
    question:
      'Жити у перспективному великому місті, але ходити голим або в забитому селі, але вдягненим?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E4',
    question:
      'Переважно віддавати перевагу романтичному сексу або спонтанному сексу?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E5',
    question:
      'Подорожувати світом безкоштовно або мати ідеальну роботу у рідному місті?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E6',
    question:
      'Завжди бути на 10 років старшим або на 10 років молодшим у стосунках?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E7',
    question: 'Мати можливість читати думки інших людей або бути невидимим?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E8',
    question: 'Дивитись на секс батьків або батьки дивляться на ваш секс?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E9',
    question:
      'Залишитися в стабільних, але менш пристрасних стосунках або спробувати нові стосунки з високим рівнем сексуальної енергії?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E10',
    question: 'Жити в епоху динозаврів або в майбутньому з роботами?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E11',
    question: 'Завжди мати ідеальний настрій або ідеальну фізичну форму?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E12',
    question:
      'Дівчини мозок опиняється в тілі твоєї мами. Трахнеш маму, в голові якої твоя дівчина, чи дівчину, в голові якої твоя мама?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E13',
    question: 'Ніколи не відчувати страх або ніколи не відчувати сум?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E14',
    question: 'Мати здатність літати або здатність телепортуватися?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E15',
    question:
      'Перемогти у лотереї мільярд доларів або знайти кохання свого життя?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E16',
    question:
      'Жити з телефоном, але зв’язок лише 1 годину в день або з ноутбуком, де зв’язок постійно?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E17',
    question: 'Запхати в дупу огірок або три маленькі помідори?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E18',
    question: 'Знати, коли ви помрете або як ви помрете?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E19',
    question: 'З’їсти казявку з носа друга або бруд з пупка друга?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E20',
    question: 'Жити в світі, де постійне літо +35 чи постійна зима -35?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E21',
    question:
      'Загубитись в місті, де тебе ніхто не розуміє без телефона, чи в лісі з телефоном, але без зв’язку?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E22',
    question: 'Покупатись голим в фонтані чи покакати при компанії друзів?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E23',
    question:
      "Тату 'лох' на лобі без болю чи на інтимному місці, але боліти буде дуже?",
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E24',
    question: 'Мати можливість розмовляти з тваринами або розуміти всі мови?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E25',
    question:
      'Жити в спокійній місцевості з обмеженими зручностями або в шумному місті з усіма благами?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E26',
    question:
      'Мати можливість виконати одне велике бажання або мати три невеликі бажання, які можуть здійснитися?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E27',
    question: 'Спати вдома тільки в палатці або тільки на коврі?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E28',
    question: 'Випити літру мочі чи з’їсти кілограм калу?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E29',
    question: 'Мати безкінечну кількість часу або безкінечну кількість грошей?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E30',
    question:
      'Завжди мати бездоганний зовнішній вигляд або завжди мати чудовий настрій?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E31',
    question: 'Мати можливість передбачати майбутнє або змінювати минуле?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E32',
    question:
      'Мати можливість телепортуватися, але завжди потрапляти в неприємні ситуації, або мати можливість літати, але з дуже дивним стилем?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E33',
    question: 'Їздити все життя лише на велосипеді або все життя ходити пішки?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E34',
    question: 'Потрахатись з інопланетянином або з людиною вашої статі?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E35',
    question: 'Ходити постійно збудженим або постійно голодним?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E36',
    question:
      'Ніколи не стати відомим, але багатим, або ніколи не стати багатим, але відомим?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E37',
    question:
      'Відсосати другу в прямому ефірі або почати стосунки з 14-річним?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E38',
    question: 'Ходити цілий день з повним памперсом або не митись місяць?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E39',
    question: 'Прожити тиждень без їжі або без води?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E40',
    question:
      'З’їсти остатки їжі з раковини або спати всю ніч в остатках від чищеної риби (лусці і кишках)?',
    category: 'Вибір (або\\або)',
  },
  {
    id: 'E41',
    question: 'Ніколи не мати дітей або ніколи не мати грошей?',
    category: 'Вибір (або\\або)',
  },
];
const CategoryActive = function () {
  const { category } = useParams<{ category: string }>();
  const filteredActiveQuestions = questionsArray.filter(
    (obj) => obj.category === category
  );
  const randomQuestionId = Math.floor(
    Math.random() * filteredActiveQuestions.length
  );

  const [questions, setQuestions] = useState('');
  const addQuestion = function () {
    setQuestions(filteredActiveQuestions[randomQuestionId].question);
  };
  return (
    <section>
      <div className="header">Розмова</div>
      <div className="category">{category}</div>
      <div
        className="question"
        style={{
          fontFamily: 'Verdana, Geneva, Tahoma, sans-serif',
          color: '#2c3e50',
        }}
      >
        {questions}
      </div>
      <button onClick={addQuestion} className="random">
        Згенерувати
      </button>
    </section>
  );
};
export default CategoryActive;
